---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.AXMImporterService
source: html/aedb078a-9923-7147-7b26-29edd9275208.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.AXMImporterService Property

The external service which permits registration of an alternate implementation for AXM import.

## Syntax (C#)
```csharp
public static ExternalServiceId AXMImporterService { get; }
```